Repository: Jahongir-Qurbonov/dj-rest-auth
Catalog: dj_rest_auth/locale/*/LC_MESSAGES/django.po
Languages: uz

source: The '{}' setting has been removed. Please refer to '{}' for available settings.
uz: '{}' sozlamasi olib tashlandi. Mavjud sozlamalar uchun '{}' ga qarang.

source: WIll override cookie.
uz: Cookie-ni bekor qiladi.

source: No valid refresh token found.
uz: Yaroqli refresh token topilmadi

source: Define callback_url in view
uz: View-da callback_url yarating

source: View is not defined, pass it as a context variable
uz: View aniqlanmadi, uni context o'zgaruvchisi sifatida uzating

source: Define adapter_class in view
uz: View-da adapter_class yarating

source: Define client_class in view
uz: View-da client_class yarating

source: Failed to exchange code for access token
uz: Code-ni access token-ga almashtirib bo‘lmadi

source: Incorrect input. access_token or code is required.
uz: Noto'g'ri kiritish. access_token yoki code talab qilinadi.

source: Incorrect value
uz: Noto'g'ri qiymat

source: A user is already registered with this e-mail address.
uz: Foydalanuvchi allaqachon ushbu e-mail manzili orqali ro'yxatdan o'tgan.

source: The two password fields didn't match.
uz: Ikkita parol maydoni mos kelmadi.

source: Verification e-mail sent.
uz: Tasdiqlash xabari e-mail orqali yuborildi.

source: Must include "email" and "password".
uz: "email" va "parol"-ni o'z ichiga olishi kerak.

source: Must include "username" and "password".
uz: "username" va "parol"-ni o'z ichiga olishi kerak.

source: Must include either "username" or "email" and "password".
uz: "username" yoki "email" va "parol"-ni o‘z ichiga olishi kerak.

source: Unable to log in with provided credentials.
uz: Taqdim etilgan hisob ma’lumotlari bilan tizimga kirib bo‘lmadi.

source: User account is disabled.
uz: Foydalanuvchi hisobi o'chirib qo'yilgan.

source: E-mail is not verified.
uz: E-mail tasdiqlanmagan.

source: Invalid value
uz: Yaroqsiz qiymat

source: Your old password was entered incorrectly. Please enter it again.
uz: Eski parolingiz noto'g'ri kiritilgan. Iltimos, yana kiriting.

source: You should be logged in to logout. Check whether the token is passed.
uz: Chiqish uchun tizimga kirgan bo'lishingiz kerak. Token o'tganligini tekshiring.

source: Successfully logged out.
uz: Tizimdan muvaffaqiyatli chiqildi.

source: Refresh token was not included in cookie data.
uz: Refresh token cookie maʼlumotlariga kiritilmagan.

source: Refresh token was not included in request data.
uz: Refresh token soʻrov maʼlumotlariga kiritilmagan

source: An error has occurred.
uz: Xatolik yuz berdi.

source: Neither cookies or blacklist are enabled, so the token has not been deleted server side. Please make sure the token is deleted client side.
uz: Cookie fayllari ham, qora roʻyxat ham yoqilmagan, shuning uchun token server tomonidan oʻchirilmagan. Token mijoz tomonidan oʻchirilganligiga ishonch hosil qiling.

source: Password reset e-mail has been sent.
uz: Parolni tiklash xabari e-mail orqali yuborildi.

source: Password has been reset with the new password.
uz: Parol yangi parol bilan almashtirildi.

source: New password has been saved.
uz: Yangi parol saqlandi.
